Repository: SH-Jisan/healthSync
Catalog: app/lib/l10n/app_*.arb
Languages: bn

# appTitle
source: HealthSync
bn: হেলথসিঙ্ক

# loginTitle
source: Welcome Back
bn: স্বাগতম

# loginSubtitle
source: Sign in to continue
bn: লগ ইন করুন

# emailLabel
source: Email Address
bn: ইমেইল অ্যাড্রেস

# passwordLabel
source: Password
bn: পাসওয়ার্ড

# loginButton
source: LOG IN
bn: লগ ইন

source: Forgot Password?
bn: পাসওয়ার্ড ভুলে গেছেন?

# dontHaveAccount
source: Don't have an account?
bn: একাউন্ট নেই?

# signupLink
source: Sign Up
bn: সাইন আপ

source: Loading...
bn: লোডিং...

source: Error
bn: ত্রুটি

source: Success
bn: সফল

source: Cancel
bn: বাতিল

source: Confirm
bn: নিশ্চিত করুন

source: Dashboard
bn: ড্যাশবোর্ড

source: Profile
bn: প্রোফাইল

source: Logout
bn: লগআউট

source: OK
bn: ঠিক আছে

source: Language
bn: ভাষা

source: Select Language
bn: ভাষা নির্বাচন করুন

source: Bangla
bn: বাংলা

source: Blood Bank
bn: ব্লাড ব্যাংক

# bloodBankSubtitle
source: Find donors & Request blood
bn: রক্তদাতা খুঁজুন এবং অনুরোধ করুন

source: About App
bn: অ্যাপ সম্পর্কে

source: Dark Mode
bn: ডার্ক মোড

source: Something went wrong!
bn: কিছু ভুল হয়েছে!

source: Retry
bn: পুনরায় চেষ্টা করুন

source: User not found
bn: ব্যবহারকারী পাওয়া যায়নি

source: My Medical History
bn: আমার মেডিকেল ইতিহাস

source: Health Plan
bn: হেলথ প্ল্যান

source: My Profile
bn: আমার প্রোফাইল

source: Timeline
bn: টাইমলাইন

source: Doctor Panel
bn: ডাক্তার প্যানেল

source: My Health Plan
bn: আমার হেলথ প্ল্যান

source: Panel
bn: প্যানেল

source: Add Hospital
bn: হাসপাতাল যোগ করুন

source: Hospital Name
bn: হাসপাতালের নাম

# visitingHours
source: Visiting Hours (e.g. 5-9 PM)
bn: পরিদর্শন সময় (যেমন: ৫-৯টা)

source: Add
bn: যোগ করুন

source: Add New Patient
bn: নতুন রোগী যোগ করুন

source: Patient Email
bn: রোগীর ইমেইল

# enterEmailSearch
source: Enter email to search
bn: খুঁজতে ইমেইল লিখুন

# patientAddedSuccess
source: Patient Added Successfully!
bn: রোগী সফলভাবে যোগ করা হয়েছে!

source: Already assigned or Error
bn: ইতিমধ্যে নিযুক্ত বা ত্রুটি

source: Current Chambers
bn: বর্তমান চেম্বার

source: No hospitals added.
bn: কোন হাসপাতাল যোগ করা হয়নি।

source: Under Treatment
bn: চিকিৎসাধীন

source: New Patient
bn: নতুন রোগী

source: Add Report
bn: রিপোর্ট যোগ করুন

# logoutConfirmation
source: Are you sure you want to log out?
bn: আপনি কি নিশ্চিত যে আপনি লগ আউট করতে চান?

source: Personal Information
bn: ব্যক্তিগত তথ্য

source: Phone Number
bn: ফোন নম্বর

source: Settings & Activity
bn: সেটিংস এবং অ্যাক্টিভিটি

source: My Appointments & History
bn: আমার অ্যাপয়েন্টমেন্ট এবং ইতিহাস

source: My Blood Requests
bn: আমার রক্তের অনুরোধ

source: My Associated Hospitals
bn: আমার সংযুক্ত হাসপাতাল

# notAssignedToHospital
source: Not assigned to any hospital yet.
bn: এখনও কোনো হাসপাতালে নিযুক্ত করা হয়নি।

source: No address
bn: ঠিকানা নেই

source: Patient History
bn: রোগীর ইতিহাস

source: My Prescriptions
bn: আমার প্রেসক্রিপশন

source: My Reports
bn: আমার রিপোর্ট

# viewPresc
source: View Prescription
bn: প্রেসক্রিপশন দেখুন

source: View Report
bn: রিপোর্ট দেখুন

source: My Care History
bn: আমার চিকিৎসা ইতিহাস

source: Appointments
bn: অ্যাপয়েন্টমেন্ট

source: Prescriptions
bn: প্রেসক্রিপশন

source: Diagnostic
bn: ডায়াগনস্টিক

source: Hospitals
bn: হাসপাতাল

source: No appointments found.
bn: কোন অ্যাপয়েন্টমেন্ট পাওয়া যায়নি।

source: Unknown Doctor
bn: অজানা ডাক্তার

source: Unknown Hospital
bn: অজানা হাসপাতাল

source: Specialist
bn: বিশেষজ্ঞ

source: PENDING
bn: অপেক্ষমাণ

source: CONFIRMED
bn: নিশ্চিত

source: No prescriptions found.
bn: কোন প্রেসক্রিপশন পাওয়া যায়নি।

source: No diagnostic records.
bn: কোন ডায়াগনস্টিক রেকর্ড নেই।

# saveLifeToday
source: Save a Life Today
bn: আজই একটি জীবন বাঁচান

# chooseOption
source: Choose an option below to proceed
bn: এগিয়ে যেতে একটি বিকল্প নির্বাচন করুন

# requestBlood
source: Request for Blood
bn: রক্তের জন্য অনুরোধ

# findDonorsNearby
source: Find donors nearby instantly
bn: তাত্ক্ষণিকভাবে রক্তদাতা খুঁজুন

# becomeDonor
source: Become a Donor
bn: রক্তদাতা হন

source: Register to save lives
bn: জীবন বাঁচাতে নিবন্ধন করুন

source: Find Blood Donors
bn: রক্তদাতা খুঁজুন

source: Search by group & location
bn: গ্রুপ এবং অবস্থান দ্বারা খুঁজুন

source: Live Requests (Feed)
bn: লাইভ অনুরোধ (ফিড)

# seeWhoNeedsHelp
source: See who needs help right now
bn: দেখুন কার সাহায্য প্রয়োজন

source: My Requests & History
bn: আমার অনুরোধ এবং ইতিহাস

source: Track your requests
bn: আপনার অনুরোধ ট্র্যাক করুন

source: My Requests
bn: আমার অনুরোধ

source: Could not launch dialer
bn: ডায়ালার চালু করা যায়নি

source: Group
bn: গ্রুপ

# districtHint
source: District (e.g. Dhaka)
bn: জেলা (যেমন: ঢাকা)

source: SEARCH DONORS
bn: রক্তদাতা খুঁজুন

source: No donors found
bn: কোন রক্তদাতা পাওয়া যায়নি

# tryChangingLocation
source: Try changing the location or blood group.
bn: অবস্থান বা রক্ত পরিবর্তন করে দেখুন।

source: Unknown Donor
bn: অজানা রক্তদাতা

source: Unknown
bn: অজানা

source: Last donated:
bn: সর্বশেষ দান:

source: Thank You, Hero!
bn: ধন্যবাদ, হিরো!

# acceptedDonationMessage
source: You have accepted to donate blood. Please contact the patient immediately.
bn: আপনি রক্তদান করতে রাজি হয়েছেন। অনুগ্রহ করে অবিলম্বে রোগীর সাথে যোগাযোগ করুন।

source: Tap to call
bn: কল করতে আলতো চাপুন

source: CLOSE
bn: বন্ধ করুন

# alreadyAccepted
source: You have already accepted this request!
bn: আপনি ইতিমধ্যে এই অনুরোধটি গ্রহণ করেছেন!

source: Unexpected Error:
bn: অপ্রত্যাশিত ত্রুটি:

source: Live Blood Requests
bn: লাইভ রক্তের অনুরোধ

source: Post Request
bn: অনুরোধ পোস্ট করুন

# noPendingRequests
source: No pending requests right now!
bn: এখন কোনো অনুরোধ নেই!

# caughtUp
source: You are all caught up.
bn: আপনি সব আপডেট দেখেছেন।

source: CRITICAL URGENCY
bn: জরুরী অবস্থা

source: Requested by
bn: অনুরোধকারী:

source: Donors Found
bn: রক্তদাতা পাওয়া গেছে

source: I CAN DONATE
bn: আমি দান করতে পারি

source: My Requests & Donors
bn: আমার অনুরোধ এবং রক্তদাতারা

source: No Requests Yet
bn: এখনও কোনো অনুরোধ নেই

# noRequestsPosted
source: You haven't posted any blood requests.
bn: আপনি কোনো রক্তের অনুরোধ পোস্ট করেননি।

source: Waiting for donors...
bn: রক্তদাতার জন্য অপেক্ষা করছি...

source: Donor(s) Accepted
bn: জন রক্তদাতা গ্রহণ করেছেন

# notifiedDonors
source: We have notified nearby donors.
bn: আমরা নিকটবর্তী রক্তদাতাদের জানিয়েছি।

# willSeeDetails
source: You will see their details here once they accept.
bn: তারা গ্রহণ করলে আপনি তাদের বিবরণ এখানে দেখতে পাবেন।

source: Unknown Hero
bn: অজানা হিরো

source: Hero Donor
bn: হিরো রক্তদাতা

# requestBloodTitle
source: Request Blood
bn: রক্তের অনুরোধ করুন

# aiAutofillSuccess
source: Form autofilled by AI! Please review.
bn: AI দ্বারা ফর্ম পূরণ করা হয়েছে! অনুগ্রহ করে পর্যালোচনা করুন।

source: AI Error:
bn: AI ত্রুটি:

# selectBloodGroupError
source: Please select Blood Group
bn: অনুগ্রহ করে রক্তের গ্রুপ নির্বাচন করুন

# requestPostedSuccess
source: Request Posted! Notifying nearby donors...
bn: অনুরোধ পোস্ট করা হয়েছে! রক্তদাতাদের জানানো হচ্ছে...

source: Error posting request:
bn: অনুরোধ পোস্ট করতে ত্রুটি:

source: Quick AI Fill
bn: দ্রুত AI পূরণ

# aiPrompt
source: Type or speak your need naturally
bn: স্বাভাবিকভাবে আপনার প্রয়োজন লিখুন

# aiHint
source: Example: "Urgent A+ blood needed at Dhaka Medical College for a road accident patient..."
bn: উদাহরণ: "সড়ক দুর্ঘটনার রোগীর জন্য ঢাকা মেডিকেলে জরুরী A+ রক্ত প্রয়োজন..."

source: Processing...
bn: প্রক্রিয়া করা হচ্ছে...

# autoFillWithAi
source: Auto-Fill Form with AI
bn: AI দিয়ে অটো-ফিল করুন

source: Manual Entry
bn: ম্যানুয়াল এন্ট্রি

source: Blood Group
bn: রক্তের গ্রুপ

source: Select Group
bn: গ্রুপ নির্বাচন করুন

source: Hospital / Location
bn: হাসপাতাল / অবস্থান

# enterHospitalHelper
source: Enter hospital name & area
bn: হাসপাতালের নাম এবং এলাকা লিখুন

source: Required
bn: প্রয়োজন

source: Urgency Level
bn: জরুরী মাত্রা

source: Select Urgency
bn: জরুরী নির্বাচন করুন

source: NORMAL
bn: স্বাভাবিক

source: CRITICAL
bn: মারাত্মক

source: Patient Condition / Note
bn: রোগীর অবস্থা / নোট

# describeSituation
source: Describe the situation...
bn: পরিস্থিতি বর্ণনা করুন...

source: POST BLOOD REQUEST
bn: রক্তের অনুরোধ পোস্ট করুন

# plan
source: Your Plan
bn: আপনার পরিকল্পনা

# noPatientsAssigned
source: No patients assigned yet.
bn: এখনও কোনও রোগী নিয়োগ করা হয়নি।

source: Hospital Admission History
bn: হাসপাতালে ভর্তির ইতিহাস

source: AI Health Assistant
bn: এআই স্বাস্থ্য সহকারী

# describeSymptomsHint
source: Describe your symptoms (e.g., 'Severe chest pain on left side')...
bn: আপনার লক্ষণগুলি বর্ণনা করুন (যেমন, 'বাম দিকে তীব্র বুকে ব্যথা')...

source: CONSULT AI DOCTOR
bn: এআই ডাক্তারের পরামর্শ নিন

source: AI Diagnosis
bn: এআই রোগ নির্ণয়

source: Possible Condition:
bn: সম্ভাব্য অবস্থা:

# potentialCauses
source: Potential Causes (Why?):
bn: সম্ভাব্য কারণ (কেন?):

source: Recommended Specialist:
bn: প্রস্তাবিত বিশেষজ্ঞ:

source: Immediate Advice:
bn: তাৎক্ষণিক পরামর্শ:

# findSpecialistNow
source: FIND {specialty} NOW
bn: এখনই {specialty} খুঁজুন

source: Report Details
bn: রিপোর্টের বিবরণ

# shareComingSoon
source: Share feature coming soon!
bn: শেয়ার ফিচার শীঘ্রই আসছে!

# typeLabel
source: Type:
bn: ধরন:

source: AI Analysis Summary
bn: এআই বিশ্লেষণ সারাংশ

# generatedByAi
source: Generated by HealthSync AI
bn: হেলথসিঙ্ক এআই দ্বারা প্রস্তুতকৃত

# noAttachment
source: No attachment available
bn: কোনো সংযুক্তি নেই

# severityHigh
source: HIGH
bn: উচ্চ

# severityMedium
source: MEDIUM
bn: মাঝারি

# severityNormal
source: NORMAL
bn: স্বাভাবিক
